function findNthDigit(n: number): number {
  if(n<=9) return n;
  n++;
  let i=2,pre = 10;
  while(n>i*(10**(i)-10**(i-1))){
    pre += i*(10**(i)-10**(i-1));
    i++;
  }
  let num = (10**(i-1))+~~((n-pre)/i),rest = (n-pre)%i;
  if(rest===0) return (num-1)%10;
  return Number((num.toString())[rest-1]);
};
//1位数 0-9 共1*10 = 10
//2位数 10-99 共2*(10**2-10**1) = 180
//3位数 100-999 共3*(10**3-10**2) = 2700
//4位数 1000-9999 共4*(10**4-10**3)
//num=363: 364-10-180 = 174/3 = 58..0 (100+58)的第0位 15(7)
//num=364: 365-10-180 = 175/3 = 58..1 (100+58)的第1位 (1)58
//num=365: 366-10-180 = 176/3 = 58..2 (100+58)的第2位 1(5)8